app/controllers/books_controller.rb

  def create
    @book = current_user.books.build(book_params)
    if @book.save
---
INSERT INTO "books" ("user_id", "title", "author", "publisher", "review", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["user_id", 1], ["title", "ONEPIECE"], ["author", "尾田栄一郎"], ["publisher", "講談社"], ["review", ""], ["created_at", "2022-09-30 05:31:51.044624"], ["updated_at", "2022-09-30 05:31:51.044624"]]