app/controllers/sessions_controller.rb

  def login(email,password)
    @user = User.find_by(email: email)
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "ikusaki@exe.com"], ["LIMIT", 1]]