app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = $1  [["user_id", 1]]
---
  def show
    @user = User.find_by(id: session[:user_id])
    if !@user
      return redirect_to login_path
    end
    @books = current_user.books.all